Autodesk.Navisworks.Api.FileInteractiveResolvedEventArgs
Event arguments used for the Application::FileInteractiveResolved event

Autodesk.Navisworks.Api.FileInteractiveResolvedEventArgs.ResolvedFileReference
Get file reference that FileReference has been resolved to, or null if not resolved

Autodesk.Navisworks.Api.FileInteractiveResolvedEventArgs.Response
Get user's response from interactive dialog.